CREATE TABLE IF NOT EXISTS books (
    id BIGSERIAL PRIMARY KEY,
    vendor_code VARCHAR(100),
    title VARCHAR(255),
    year VARCHAR(10),
    brand VARCHAR(100),
    stock INTEGER,
    price NUMERIC(10, 2)
    );

INSERT INTO books (vendor_code, title, year, brand, stock, price) VALUES
    ('RC001', 'Война и мир', '1869', 'Лев Толстой', 5, 19.99),
    ('RC002', 'Преступление и наказание', '1866', 'Фёдор Достоевский', 8, 17.50),
    ('RC003', 'Братья Карамазовы', '1880', 'Фёдор Достоевский', 4, 21.00),
    ('RC004', 'Анна Каренина', '1877', 'Лев Толстой', 6, 18.75),
    ('RC005', 'Евгений Онегин', '1833', 'Александр Пушкин', 10, 14.20),
    ('RC006', 'Капитанская дочка', '1836', 'Александр Пушкин', 7, 13.50),
    ('RC007', 'Мастер и Маргарита', '1967', 'Михаил Булгаков', 9, 22.00),
    ('RC008', 'Ревизор', '1836', 'Николай Гоголь', 6, 12.80),
    ('RC009', 'Мёртвые души', '1842', 'Николай Гоголь', 5, 16.90),
    ('RC010', 'Доктор Живаго', '1957', 'Борис Пастернак', 4, 20.00),
    ('RC011', 'Идиот', '1869', 'Фёдор Достоевский', 5, 19.00),
    ('RC012', 'Дубровский', '1841', 'Александр Пушкин', 7, 13.99),
    ('RC013', 'Герой нашего времени', '1840', 'Михаил Лермонтов', 8, 15.40),
    ('RC014', 'Илиада', '-750', 'Гомер', 6, 25.00),
    ('RC015', 'Одиссея', '-700', 'Гомер', 6, 25.00);